---
kind: method
id: M:Autodesk.Revit.DB.FilterElement.IsNameUnique(System.String)
source: html/018d3415-a9b7-0935-98cd-453022be6f59.htm
---
# Autodesk.Revit.DB.FilterElement.IsNameUnique Method

Determines whether a potential filter element name is unique.

## Syntax (C#)
```csharp
public bool IsNameUnique(
	string name
)
```

## Parameters
- **name** (`System.String`) - The candidate name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null